In [2]:
import pandas as pd

# read the datasets social network ads
df = pd.read_csv('Social_Network_Ads.csv')

# drop kolom yang tidak diperlukan
data = df.drop(columns=['User ID'])

# menjalankan prose one hot encoding dengan pd.get_dummies(data)

data

     Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0     19            19000          0              0            1
1     35            20000          0              0            1
2     26            43000          0              1            0
3     27            57000          0              1            0
4     19            76000          0              0            1
..   ...              ...        ...            ...          ...
395   46            41000          1              1            0
396   51            23000          1              0            1
397   50            20000          1              1            0
398   36            33000          0              0            1
399   49            36000          1              1            0

[400 rows x 5 columns]

In [3]:
# memisahkan atribut dan label

predictions = ['Age', 'EstimatedSalary', 'Gender_Female', 'Gender_Male']
X = data[predictions]
y = data['Purchased']

In [4]:
from sklearn.preprocessing import StandardScaler

# melakukan standarisasi dengan data yang kita miliki menggunakan StandardScaler()
normal = StandardScaler()
normal.fit(X)

normal_data = normal.transform(X)
normal_data = pd.DataFrame(normal_data, columns= X.columns)
normal_data.head()

        Age  EstimatedSalary  Gender_Female  Gender_Male
0 -1.781797        -1.490046      -1.020204     1.020204
1 -0.253587        -1.460681      -1.020204     1.020204
2 -1.113206        -0.785290       0.980196    -0.980196
3 -1.017692        -0.374182       0.980196    -0.980196
4 -1.781797         0.183751      -1.020204     1.020204

In [9]:
from sklearn.model_selection import train_test_split

# memisahkan data menjadi train dan test untuk setiap atribut dan label
# karena var X di normalisasi jadi kita menggunakan data yang telah dinormalisasi yaitu normal_data
X_train, X_test, y_train, y_test = train_test_split(normal_data, y, test_size= 0.2, random_state=1)
print(len(X_test))

80

In [18]:

from sklearn.linear_model import LogisticRegression

# membuat model logistic Regression
model = LogisticRegression()

# latih model dengan data train menggunakan function fit()
model.fit(X_train, y_train)

# menguji akurasi model pada test set dengan memanggil fungsi score() pada objek model.
model.score(X_test, y_test)

0.825